// ignore_for_file: file_names

main(List<String> args) {
  //first way
  // for (var i = 1; i <= 10; i++) {
  //   for (var x = 1; x <= 10; x++) {
  //     print("$i * $x = ${i * x}");
  //   }
  // }
  //sec way
  // // var a = 1;
  // // while (a <= 10) {
  // //   var s = 1;
  // //   while (s <= 10) {
  // //     print("$a * $s = ${a * s}");
  // //     s++;
  // //   }
  // //   a++;
  // // }
  //third way
// // //   var a = 1;
// // //   do {
// // //     var s = 1;
// // //     do {
// // //       print("$a * $s = ${a * s}");
// // //       s++;
// // //     } while (s <= 10);
// // //     a++;
// // //   } while (a <= 10);
// // // 
// دي طريقة الإنفنتي لووب
// الفكرة هنا إنه بيخلي الشرط دايما يتحقق، فالناتج دايما هايتطبع إلى ما لا نهاية
var x = 1;
while (x<=10) {
  print("object");
  x++; // هنا انا حددت العدد عشان لما بيبقى انفنتي بيهنج البرنامج
  // x-- ممكن نحط الكود دا برده وهايدينا نفس الناتج
}

}
