// ignore_for_file: file_names
void main(List<String> args) {
  List<int> a = [1, 2, 3, 4];

  var w = null;
  
  Iterable<List> b = [
    [1, ...? w, ...a, ...[1, 2, 3], [4, 5, 6], 6],
    // هل الليست فيها حاجة؟ لو اه هايطبع، بس هي مافيهاش حاجة فمطبعش الدابليو
    // ال... بتاخد القيم وتخليها جزء من الليست كلها
    // من غير ال... بتاخدها كليست مش كقيم متفصصة
    [7, 8, if (a.length == 3)/*لو عدد الليست 3 اعتمد*/ ...a, 10, 11, 12]
  ];
  print(b);
  var e = b.toList(); // حولنا ال بي من نوع أيتيرل إلى ليست عشان نعرف ن-فور إتش
  e.forEach((element) {print(element);}); // another way to print

  
  
  
  var c = {1, 2, 3, 4};
   for (var item in c) { // الأيتم هنا بتمر على كل قيمة وتكون القيمة دي في قيم الليست
    print(item);
  } 
  var d = {a: 1, b: 2, c: 3};

 


  
  var x = [1, 3, 2.5, 4, 6];
  print(x.any((element) => element % 2 == 0)); // هل فيه اي حاجة بتحقق الشرط دا؟
 
 List<List<int>> u = [[1, 3, 2]];
  num k = 0;
  List q = u[0].map((e) => k += e).toList(); // غيرنا النوع من أيتيرابل ل ليست، فهتلاقي اقواس الران اتغيرت لاقواس ليست 
  // الماب هنا بتعمل ريتيرن للقيم
  // هنا بتقوله عدي على كل قيمة وزود عليها قيمة الكية اللي هي صفر وبتزيد كل مرة الكية بياخد قيمة
  // وهاتجمعلي القيم كلها وتبقى هي قيمة كية (المجموع التراقمي يعني)
  print(q);
  print(k);


}